{
  "port-modelling-fe": {
    "queueingSystem": {
      "name": "Система массового обслуживания",
      "description": "(СМО) — система, которая производит обслуживание поступающих в неё требований. Обслуживание требований в СМО осуществляется обслуживающими приборами. Классическая СМО содержит от одного до бесконечного числа приборов. В зависимости от наличия возможности ожидания поступающими требованиями начала обслуживания СМО подразделяются на:",
      "withReject": "системы с потерями, в которых требования, не нашедшие в момент поступления ни одного свободного прибора, теряются;",
      "withInfQueue": "системы с ожиданием, в которых имеется накопитель бесконечной ёмкости для буферизации поступивших требований, при этом ожидающие требования образуют очередь;",
      "withQueue": "системы с накопителем конечной ёмкости (ожиданием и ограничениями), в которых длина очереди не может превышать ёмкости накопителя; при этом требование, поступающее в переполненную СМО (отсутствуют свободные места для ожидания), теряется.",
      "queueDescription": "Выбор требования из очереди на обслуживание производится с помощью так называемой дисциплины обслуживания. Их примерами являются FCFS/FIFO (пришедший первым обслуживается первым), LCFS/LIFO (пришедший последним обслуживается первым), random (случайный выбор). В системах с ожиданием накопитель в общем случае может иметь сложную структуру.",
      "definitions": {
        "title": "Основные понятия СМО",
        "request": " — запрос на обслуживание.",
        "arrivals": " — совокупность требований, поступающих в СМО.",
        "serveTime": " — период времени, в течение которого обслуживается требование.",
        "model": " — это совокупность математических выражений, описывающих входящий поток требований, процесс обслуживания и их взаимосвязь."
      }
    },
    "homepage": {
      "title": "Морской порт как система массового обслуживания",
      "viewModelExample": "Посмотреть пример построения модели",
      "buildModel": "Смоделировать систему",
      "buildCharts": "Построить графики характеристик",
      "whatIsIt": "(Что это такое?)",
      "buildChartsDescription": "Раздел системы позволяет построить графики характеристик системы в зависимости от заданных пользователем параметров.",
      "viewModelExampleDescription": "Раздел системы содержит пример построения математической модели порта, а также примеры вычисления характеристик системы, основанные на реальных данных",
      "buildModelDescription": "Раздел системы позволяет при помощи имитационного моделирования построить модель работы порта, на основе заданных пользователем параметров."
    },
    "systemExample": {
      "model": "Математическая модель",
      "symbols": "Основные обозначения"
    },
    "common": {
      "close": "Закрыть",
      "request": "Требование (заявка)",
      "arrivals": "Входящий поток требований",
      "serveTime": "Время обслуживания",
      "model": "Математическая модель СМО"
    },
    "kendall": {
      "title": "Символика Кенделла",
      "description": "Для описания системы массового обслуживания используется символика <b>Кендалла</b>. Она использует следующие обозначения:",
      "descriptionA": "Закон распределения поступающего потока вызовов",
      "descriptionS": "Закон распределения времени обслуживания",
      "descriptionC": "Количество каналов обслуживания",
      "descriptionK": "Вместимость системы, максимальное количество заявок в системе, включая обслуживаемые",
      "descriptionN": "Количество источников поступления заявок",
      "descriptionD": "Дисциплина очереди"
    }
  }
}
