{
  "port-modelling-fe": {
    "queueingSystem": {
      "name": "Система массового обслуживания",
      "description": "(СМО) — система, которая производит обслуживание поступающих в неё требований. Обслуживание требований в СМО осуществляется обслуживающими приборами. Классическая СМО содержит от одного до бесконечного числа приборов. В зависимости от наличия возможности ожидания поступающими требованиями начала обслуживания СМО подразделяются на:",
      "withReject": "системы с потерями, в которых требования, не нашедшие в момент поступления ни одного свободного прибора, теряются;",
      "withInfQueue": "системы с ожиданием, в которых имеется накопитель бесконечной ёмкости для буферизации поступивших требований, при этом ожидающие требования образуют очередь;",
      "withQueue": "системы с накопителем конечной ёмкости (ожиданием и ограничениями), в которых длина очереди не может превышать ёмкости накопителя; при этом требование, поступающее в переполненную СМО (отсутствуют свободные места для ожидания), теряется.",
      "queueDescription": "Выбор требования из очереди на обслуживание производится с помощью так называемой дисциплины обслуживания. Их примерами являются FCFS/FIFO (пришедший первым обслуживается первым), LCFS/LIFO (пришедший последним обслуживается первым), random (случайный выбор). В системах с ожиданием накопитель в общем случае может иметь сложную структуру.",
      "definitions": {
        "title": "Основные понятия СМО",
        "request": " — запрос на обслуживание.",
        "arrivals": " — совокупность требований, поступающих в СМО.",
        "serveTime": " — период времени, в течение которого обслуживается требование.",
        "model": " — это совокупность математических выражений, описывающих входящий поток требований, процесс обслуживания и их взаимосвязь."
      }
    },
    "homepage": {
      "title": "Морской порт как система массового обслуживания",
      "viewModelExample": "Посмотреть пример построения модели",
      "buildModel": "Смоделировать систему",
      "buildCharts": "Построить графики характеристик",
      "whatIsIt": "(Что это такое?)",
      "buildChartsDescription": "Раздел системы позволяет построить графики характеристик системы в зависимости от заданных пользователем параметров.",
      "viewModelExampleDescription": "Раздел системы содержит пример построения математической модели порта, а также примеры вычисления характеристик системы, основанные на реальных данных",
      "buildModelDescription": "Раздел системы позволяет при помощи имитационного моделирования построить модель работы порта, на основе заданных пользователем параметров."
    },
    "systemExample": {
      "titles": {
        "model": "Математическая модель",
        "symbols": "Основные обозначения",
        "characteristics": "Вычисление характеристик"
      },
      "symbols": "Основные обозначения",
      "symbolsDescriptionHeader": "Для расчета характеристик системы массового обслуживания использованы следующие обозначения:",
      "lambda": "интенсивность входящего потока заявок;",
      "mu": "интенсивность обслуживания заявок;",
      "t": "время обслуживания;",
      "e_w": "среднее время пребывания заявки в очереди (при наличии очереди);",
      "p_0": "вероятность того, что все каналы свободны;",
      "rho": "приведенная интенсивность, нагрузка СМО;",
      "p_k": "вероятность того, что заняты k каналов;",
      "n": "количество каналов (причалов);",
      "m": " длина очереди;",
      "q": "среднее число заявок в очереди.",
      "modelDescription": {
        "header": "Моделирование работы разгрузочного терминала морского порта",
        "intro": "Для работы портов характерным является поток входных заявок от судов, поступающих в порт на производство погрузочно-разгрузочных работ (ПРР). В соответствии с этими заявками суда могут ставиться для производства ПРР на один из нескольких причалов порта, образующих причальный фронт. Эксплуатационная деятельность порта, связанная с обработкой судов, может условно (схематично) рассматриваться как функционирование локальной СМО, предназначенной для обслуживания транспортных судов по случайно возникающим запросам.",
        "structure": "Портовый терминал разгрузки определяется как система массового обслуживания со следующей структурой: суда с грузами - это входные единицы (заявки), которые формируют (или нет) очереди (в зависимости от непосредственной ситуации), ожидающие обслуживания (разгрузки) у причала и, после обслуживания покидающие систему.",
        "terminal": {
          "characteristicTitle": "С точки зрения теории массового обслуживания портовый терминал имеет следующие характеристики:",
          "openSystem": "Терминал - это открытая система, поскольку суда не являются ее составной частью.",
          "channels": "Терминал - это одноканальная или многоканальная система (в зависимости от количества причалов), в связи с чем суда в море или на якорной стоянке образуют очереди к определенным причалам.",
          "arrivalDistribution": "Количество прибывших судов, а также продолжительность обслуживания т.е. продолжительность стоянки судна у причала распределяется в соответствии с определенными теоретическими распределениями (чаще всего на основе распределения Пуассона). Время обслуживания судна вместе со временем, проведенным в очереди, представляет собой время пребывания судна на терминале и является одним из наиболее важных показателей работы терминала в порту.",
          "queueDiscipline": "Что касается дисциплины очереди, разгрузочный терминал - это система, в которой обслуживание чаще всего осуществляется в соответствии с правилом FIFO (первым пришел - первым обслужен), но допускается существование определенных видов судов, которые имеют приоритет в обслуживании.",
          "noConnection": "Не существует взаимодействия между погрузочным и разгрузочным терминалом"
        },
        "arrivals": {
          "title": "Поток прихода судов - стационарный Пуассоновский поток со следующими свойствами:",
          "independent": "независимость от времени, в произвольно выбранный малый промежуток времени вероятность прибытия более одного судна очень мала, т.е. суда заходят в порт отдельно",
          "noRemember": "свойство ”без запоминания“, заходы судов независимы",
          "stationary": "стационарность: интенсивность потока судов независит от времени,поскольку является постоянной величиной, зависящей только от продолжительности наблюдаемого периода."
        }
      }
    },
    "common": {
      "close": "Закрыть",
      "request": "Требование (заявка)",
      "arrivals": "Входящий поток требований",
      "serveTime": "Время обслуживания",
      "model": "Математическая модель СМО",
      "symbol": "Обозначение",
      "name": "Название",
      "description": "Описание",
      "examples": "Примеры"
    },
    "kendall": {
      "title": "Символика Кендалла",
      "description": "Для описания системы массового обслуживания используется символика <b>Кендалла</b>. Она использует следующие обозначения:",
      "descriptionA": "Закон распределения поступающего потока вызовов",
      "descriptionS": "Закон распределения времени обслуживания",
      "descriptionC": "Количество каналов обслуживания",
      "descriptionK": "Вместимость системы, максимальное количество заявок в системе, включая обслуживаемые",
      "descriptionN": "Количество источников поступления заявок",
      "descriptionD": "Дисциплина очереди",
      "arrivalExamples": {
        "markovian": "Марковский или процесс без запоминания",
        "markovianDescription": "Пуассоновский процесс поступления заявок (экспоненциальное распределение).",
        "general": ""
      },
      "serviceExamples": {
        "markovian": "Марковский или процесс без запоминания",
        "markovianDescription": "Экспоненциальный закон распределения"
      },
      "queueExamples": {
        "fifo": "Первый пришел, первый обслужен",
        "fifoDescription": "Заявки обслуживаются в порядке, в котором они поступили (используется по умолчанию).",
        "lifo": "Последний пришел, первый обслужен",
        "lifoDescription": "Заявки обслуживаются в обратном порядке тому, в котором они поступили.",
        "siro": "Обслуживание в случайном порядке",
        "siroDescription": "Заявки обслуживаются в случайном порядке, не зависимо от порядка поступления.",
        "pq": "Приоритетная очередь",
        "pqDescription": "Существует несколько видов приоритетных очередей"
      }
    }
  }
}
